0519: modified graph
